Public Member Functions | Friends | List of all members
ACAPI::DesignOptions::DesignOptionSet Class Reference
Design Options
A class that represents the design option set. More...
#include <DesignOptionSet.hpp>
 Inheritance diagram for ACAPI::DesignOptions::DesignOptionSet:
 Public Member Functions
Result< void >  | IsEditable () const
Checks whether the design option set is editable.
GS::UniString  | GetName () const
GS::Guid  | GetGuid () const
Result< void >  | SetName (const GS::UniString &newName)
Sets the name of the Design Option.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | DesignOptionManager
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that represents the design option set.
Since
Archicad 29
Member Function Documentation
◆ GetGuid()
 GS::Guid ACAPI::DesignOptions::DesignOptionSet::GetGuid  |  ( |   | ) |   const
Returns
The guid of the design option set.
◆ GetName()
 GS::UniString ACAPI::DesignOptions::DesignOptionSet::GetName  |  ( |   | ) |   const
Returns
The name of the design option set.
◆ IsEditable()
 Result< void > ACAPI::DesignOptions::DesignOptionSet::IsEditable  |  ( |   | ) |   const
Checks whether the design option set is editable.
Returns
Ok if editable or Error otherwise.
◆ SetName()
 Result< void > ACAPI::DesignOptions::DesignOptionSet::SetName  |  ( |  const GS::UniString & |  newName | )
Sets the name of the Design Option.
Returns
Result of the modification.
Parameters
newName | The new name to be set.
Precondition
This function needs to be called from an undo scope.